{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 512,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          2
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          3
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "[CLS]": 2,
      "[SEP]": 3,
      "[MASK]": 4,
      "!": 5,
      "\"": 6,
      "#": 7,
      "$": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      ",": 14,
      "-": 15,
      ".": 16,
      "/": 17,
      "0": 18,
      "1": 19,
      "2": 20,
      "3": 21,
      "4": 22,
      "5": 23,
      "6": 24,
      "7": 25,
      "8": 26,
      "9": 27,
      ":": 28,
      ";": 29,
      "=": 30,
      "?": 31,
      "\\": 32,
      "_": 33,
      "a": 34,
      "b": 35,
      "c": 36,
      "d": 37,
      "e": 38,
      "f": 39,
      "g": 40,
      "h": 41,
      "i": 42,
      "j": 43,
      "k": 44,
      "l": 45,
      "m": 46,
      "n": 47,
      "o": 48,
      "p": 49,
      "q": 50,
      "r": 51,
      "s": 52,
      "t": 53,
      "u": 54,
      "v": 55,
      "w": 56,
      "x": 57,
      "y": 58,
      "z": 59,
      "##o": 60,
      "##k": 61,
      "##u": 62,
      "##l": 63,
      "##a": 64,
      "##n": 65,
      "##r": 66,
      "##i": 67,
      "##s": 68,
      "##t": 69,
      "##e": 70,
      "##y": 71,
      "##z": 72,
      "##f": 73,
      "##w": 74,
      "##d": 75,
      "##1": 76,
      "##9": 77,
      "##4": 78,
      "##c": 79,
      "##h": 80,
      "##p": 81,
      "##g": 82,
      "##v": 83,
      "##m": 84,
      "##q": 85,
      "##b": 86,
      "##3": 87,
      "##x": 88,
      "##5": 89,
      "##2": 90,
      "##0": 91,
      "##j": 92,
      "##6": 93,
      "##8": 94,
      "##7": 95,
      "##er": 96,
      "th": 97,
      "##in": 98,
      "##es": 99,
      "##on": 100,
      "##or": 101,
      "the": 102,
      "##an": 103,
      "##ed": 104,
      "##ar": 105,
      "##en": 106,
      "##at": 107,
      "in": 108,
      "##ing": 109,
      "##al": 110,
      "to": 111,
      "##it": 112,
      "##st": 113,
      "##ic": 114,
      "of": 115,
      "##ro": 116,
      "an": 117,
      "##ay": 118,
      "##il": 119,
      "##ion": 120,
      "##as": 121,
      "##ou": 122,
      "##el": 123,
      "##is": 124,
      "##ter": 125,
      "##ec": 126,
      "##et": 127,
      "##id": 128,
      "##om": 129,
      "##re": 130,
      "on": 131,
      "and": 132,
      "##ent": 133,
      "st": 134,
      "for": 135,
      "##ac": 136,
      "##ur": 137,
      "re": 138,
      "##ad": 139,
      "##ir": 140,
      "##ol": 141,
      "##am": 142,
      "##ts": 143,
      "##ig": 144,
      "##ot": 145,
      "##le": 146,
      "##day": 147,
      "##ers": 148,
      "##ut": 149,
      "39": 150,
      "##ill": 151,
      "##ve": 152,
      "ne": 153,
      "##ow": 154,
      "##us": 155,
      "##ch": 156,
      "ch": 157,
      "##th": 158,
      "##est": 159,
      "com": 160,
      "##ra": 161,
      "as": 162,
      "##ver": 163,
      "##un": 164,
      "##ation": 165,
      "at": 166,
      "##im": 167,
      "be": 168,
      "##ly": 169,
      "##os": 170,
      "de": 171,
      "pro": 172,
      "##ith": 173,
      "is": 174,
      "with": 175,
      "pr": 176,
      "##ak": 177,
      "##igh": 178,
      "sh": 179,
      "##ag": 180,
      "##ce": 181,
      "that": 182,
      "##ul": 183,
      "con": 184,
      "##ear": 185,
      "new": 186,
      "##and": 187,
      "wh": 188,
      "ap": 189,
      "un": 190,
      "##ess": 191,
      "##ri": 192,
      "##ld": 193,
      "sa": 194,
      "qu": 195,
      "##op": 196,
      "af": 197,
      "##ters": 198,
      "sp": 199,
      "le": 200,
      "##ist": 201,
      "##ain": 202,
      "##oc": 203,
      "ex": 204,
      "##ast": 205,
      "##oun": 206,
      "it": 207,
      "##em": 208,
      "##ect": 209,
      "##ks": 210,
      "its": 211,
      "pl": 212,
      "##ap": 213,
      "##all": 214,
      "##ian": 215,
      "se": 216,
      "by": 217,
      "##ate": 218,
      "us": 219,
      "al": 220,
      "said": 221,
      "##uters": 222,
      "##um": 223,
      "comp": 224,
      "en": 225,
      "##ia": 226,
      "##oo": 227,
      "##ft": 228,
      "##up": 229,
      "has": 230,
      "reuters": 231,
      "##ies": 232,
      "ag": 233,
      "##ore": 234,
      "##rom": 235,
      "##our": 236,
      "was": 237,
      "##iv": 238,
      "##ust": 239,
      "off": 240,
      "##ost": 241,
      "from": 242,
      "##ight": 243,
      "wor": 244,
      "##ort": 245,
      "##00": 246,
      "he": 247,
      "##ack": 248,
      "##ity": 249,
      "##ment": 250,
      "we": 251,
      "up": 252,
      "will": 253,
      "##ard": 254,
      "mon": 255,
      "##uc": 256,
      "##ip": 257,
      "##art": 258,
      "fr": 259,
      "##ell": 260,
      "##ial": 261,
      "##ine": 262,
      "after": 263,
      "ac": 264,
      "his": 265,
      "##esday": 266,
      "cl": 267,
      "##ug": 268,
      "##ive": 269,
      "##ud": 270,
      "year": 271,
      "lt": 272,
      "##ie": 273,
      "ha": 274,
      "over": 275,
      "##end": 276,
      "##ab": 277,
      "##ry": 278,
      "op": 279,
      "fir": 280,
      "##ob": 281,
      "##if": 282,
      "inc": 283,
      "gt": 284,
      "am": 285,
      "sec": 286,
      "exp": 287,
      "##ens": 288,
      "##ice": 289,
      "mar": 290,
      "##oft": 291,
      "##qu": 292,
      "##ere": 293,
      "res": 294,
      "rep": 295,
      "int": 296,
      "##ace": 297,
      "##ions": 298,
      "##ould": 299,
      "inter": 300,
      "##ge": 301,
      "ser": 302,
      "ab": 303,
      "##are": 304,
      "##ans": 305,
      "tw": 306,
      "##ub": 307,
      "win": 308,
      "ind": 309,
      "have": 310,
      "quot": 311,
      "go": 312,
      "or": 313,
      "##ays": 314,
      "##ick": 315,
      "##ning": 316,
      "ar": 317,
      "are": 318,
      "##any": 319,
      "##ant": 320,
      "out": 321,
      "rec": 322,
      "##ond": 323,
      "their": 324,
      "##ke": 325,
      "##ord": 326,
      "##ong": 327,
      "gro": 328,
      "co": 329,
      "ad": 330,
      "##out": 331,
      "fin": 332,
      "two": 333,
      "tr": 334,
      "##ame": 335,
      "br": 336,
      "bl": 337,
      "pe": 338,
      "##ish": 339,
      "##ue": 340,
      "##ome": 341,
      "no": 342,
      "##arg": 343,
      "sc": 344,
      "first": 345,
      "##illion": 346,
      "##mp": 347,
      "##ree": 348,
      "##ach": 349,
      "##ail": 350,
      "per": 351,
      "cr": 352,
      "##ile": 353,
      "##ign": 354,
      "but": 355,
      "##old": 356,
      "##ork": 357,
      "##ide": 358,
      "##ime": 359,
      "ira": 360,
      "app": 361,
      "world": 362,
      "iraq": 363,
      "##ors": 364,
      "##ich": 365,
      "##ros": 366,
      "more": 367,
      "not": 368,
      "##ident": 369,
      "##ake": 370,
      "lead": 371,
      "##og": 372,
      "##oll": 373,
      "cont": 374,
      "##ous": 375,
      "bus": 376,
      "pres": 377,
      "dis": 378,
      "##ek": 379,
      "##amp": 380,
      "again": 381,
      "200": 382,
      "##ber": 383,
      "inv": 384,
      "el": 385,
      "##age": 386,
      "man": 387,
      "##ices": 388,
      "##own": 389,
      "##urs": 390,
      "##ase": 391,
      "##ass": 392,
      "te": 393,
      "la": 394,
      "##ations": 395,
      "##od": 396,
      "##ff": 397,
      "this": 398,
      "##rop": 399,
      "can": 400,
      "##ester": 401,
      "fl": 402,
      "##ets": 403,
      "##ound": 404,
      "one": 405,
      "##iz": 406,
      "min": 407,
      "##ates": 408,
      "##ep": 409,
      "cor": 410,
      "ph": 411,
      "##ure": 412,
      "intern": 413,
      "##act": 414,
      "##av": 415,
      "eu": 416,
      "company": 417,
      "##iday": 418,
      "wed": 419,
      "monday": 420,
      "oil": 421,
      "high": 422,
      "##one": 423,
      "president": 424,
      "##ary": 425,
      "##ock": 426,
      "##hn": 427,
      "##der": 428,
      "tu": 429,
      "wedn": 430,
      "wednesday": 431,
      "##ance": 432,
      "tuesday": 433,
      "all": 434,
      "##ict": 435,
      "than": 436,
      "play": 437,
      "##ursday": 438,
      "acc": 439,
      "##ory": 440,
      "thursday": 441,
      "##ton": 442,
      "##ite": 443,
      "ear": 444,
      "sun": 445,
      "##ank": 446,
      "##ull": 447,
      "rel": 448,
      "mic": 449,
      "##her": 450,
      "##iss": 451,
      "##ence": 452,
      "war": 453,
      "##mer": 454,
      "##ount": 455,
      "hel": 456,
      "against": 457,
      "week": 458,
      "friday": 459,
      "##anc": 460,
      "##ose": 461,
      "##ated": 462,
      "##ade": 463,
      "str": 464,
      "##ational": 465,
      "##arter": 466,
      "air": 467,
      "##ited": 468,
      "mark": 469,
      "##ood": 470,
      "into": 471,
      "last": 472,
      "##earch": 473,
      "att": 474,
      "##ther": 475,
      "invest": 476,
      "dec": 477,
      "corp": 478,
      "mo": 479,
      "ann": 480,
      "##gh": 481,
      "##ey": 482,
      "report": 483,
      "they": 484,
      "##urn": 485,
      "about": 486,
      "micros": 487,
      "##etw": 488,
      "peop": 489,
      "kill": 490,
      "offic": 491,
      "so": 492,
      "##ican": 493,
      "york": 494,
      "##ven": 495,
      "bu": 496,
      "serv": 497,
      "pol": 498,
      "##ason": 499
    }
  }
}